Revit 2026 API

# RebarConstraintSetDistanceToTargetRebar Method

---

Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDistanceToTargetRebar(
	double distanceToTargetRebar
)
```
```vb
Public Sub SetDistanceToTargetRebar (
	distanceToTargetRebar As Double
)
```
```cpp
public:
void SetDistanceToTargetRebar(
	double distanceToTargetRebar
)
```
```fsharp
member SetDistanceToTargetRebar :
        distanceToTargetRebar : float -> unit
```

#### Parameters

distanceToTargetRebar Double
     The distance is given as an offset value, the sign of which depends on the target bar handle direction.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value. |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'. |

Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace